app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # assign the post to the user who created it
        respond_to do |f|
            if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hey!"], ["user_id", 4], ["created_at", "2017-01-10 22:50:49.271206"], ["updated_at", "2017-01-10 22:50:49.271206"]]